export interface Club {
  id: string
  name: string
  children: string[]
  staff: string[]
}

export const clubs: Club[] = [
  {
    id: 'erez',
    name: 'ארז',
    children: ['גומא גלאל', 'איתמר וילדר', 'זהר בונדי שבתאי', 'זהר ספא', 'איתן מיכאלי', 'איתן צור', 'גוני פלד', 'אלה פריימרק', 'רומי גרזון', 'רני וסר', 'עלמה שביט', 'יהלי הופמן', 'יובל אופנר', 'רותם שוהם', 'יעל צינמן', 'אריאה דוד', 'אורן רייזנר', 'רוני רזניק רומנו', 'יערה קורנר', 'ירדן נץ', 'ביני לבנה גולדברג', 'עמליה יורה'],
    staff: ['דורית שצברג', 'יעל פרימן', 'מרסל נועה'],
  },
  {
    id: 'pistachio',
    name: 'פיסטוק',
    children: ['מילה שושן', 'אורי סגמן', 'אורן אשכול', 'אמה ארצי', 'ארי שנטל', 'בר נודלמן', 'דן בודנהימר', 'אלון מלקר', 'ליאור זינו', 'עומר קולבק', 'עומר קזאז', 'עילי לואיס', 'רון פרימן', 'רונה ונדר', 'שי קזאז'],
    staff: ['הלל בלו', 'נעמה יצחק'],
  },
  {
    id: 'tomer',
    name: 'תומר',
    children: ['אביגיל סגל', 'אימרי הופמן', 'יעל אברבנאל', 'עתי לואיס', 'רומי סקין', 'שקד סגל', 'קדם סולומון', 'אדם מרדוק', 'איתמר וולף', 'אלה אופנר', 'דריה פריימרק', 'הראל שפירא', 'חגי כוחן', 'יונתן עמר', 'יעל גינזבורג', 'מאיה שילון', 'נעה שעני', 'נרין חולות', 'רוני אלפיה', 'שיר פוטוק', 'תהל טובי צור', 'אורי גרזון', 'איתם גל-אל', 'אסף קולבק', 'בארי פריימרק', 'גילי אטיאס', 'גלי ספיר', 'יהלי גרזון', 'ליאו ארצי', 'מזור גרזון', 'נועם ברק', 'עומר וילדר', 'עמית יורה', 'עמית נודלמן', 'רומי וסר', 'שירה יהב', 'שקד זינו'],
    staff: ['יותם שמול', 'אורטל ונדר', 'הלן מולה', 'נור נבארי', 'נועם פרימן'],
  },
  {
    id: 'dekel',
    name: 'דקל',
    children: ['גיא קזאז', 'דוד ברגיא', 'יעל גורן', 'ליהיא שחר', 'נדב שעני', 'ניצן אלפיה', 'סהר חולות וולוז\'ני', 'אבינעם גייגר', 'יעל מלקר', 'ארי ונדר', 'דניאל הופמן', 'דניאל עמר', 'יהב טובי צור', 'מיכאלה אבוטבול', 'מיקה ספיר', 'מעיין שטיין', 'נוב סגל', 'נועה ג\'יימס', 'נועם ימין', 'נעם יפה', 'עידו יעיש', 'עידו שביט', 'עילי אוראל', 'עמית ברק', 'שני בלום', 'תבל גל-אל', 'אביתר שצברג', 'מילי סולומון', 'אייל מלקר', 'מילה גרינפלד', 'דנה צור'],
    staff: ['טל אופיר'],
  },
]

export function getClubById(id: string): Club | undefined {
  return clubs.find(c => c.id === id)
}
